rushairer/LearnCW32/Libraries/inc/cw32f030_rcc.h
#define RCC_SYSCTRL_LOCKUPEN                    bv2
#define RCC_SYSCTRL_LOCKUPDIS                   0x00UL
#define IS_RCC_LOCKUP_STATUS(INSTANCE)          (((INSTANCE) == RCC_SYSCTRL_LOCKUPEN) ||\
                                                 ((INSTANCE) == RCC_SYSCTRL_LOCKUPDIS))

#define RCC_SYSCTRL_WAKEUPCLKEN                 bv3
#define RCC_SYSCTRL_WAKEUPCLKDIS                0x00UL
#define IS_RCC_WAKEUPCLK_STATUS(INSTANCE)       (((INSTANCE) == RCC_SYSCTRL_WAKEUPCLKEN) ||\
                                                 ((INSTANCE) == RCC_SYSCTRL_WAKEUPCLKDIS))
/* SYSCTRL HSI --------------------------------------------------------*/
#define RCC_HSI_TRIMCODEADDR                    (0x00012600U)
#define RCC_HSIOSC_DIV6                         (0x5U)
#define RCC_HSIOSC_DIV1                         (0x6U)
#define RCC_HSIOSC_DIV2                         (0x8U)
#define RCC_HSIOSC_DIV3                         (0x7U)
#define RCC_HSIOSC_DIV4                         (0x9U)
#define RCC_HSIOSC_DIV8                         (0xBU)
#define RCC_HSIOSC_DIV10                        (0xCU)
#define RCC_HSIOSC_DIV12                        (0xDU)
#define RCC_HSIOSC_DIV14                        (0xEU)
#define RCC_HSIOSC_DIV16                        (0xFU)

#define IS_RCC_HSIOSC_DIV(INSTANCE)             (((INSTANCE) == RCC_HSIOSC_DIV1)  ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV2)  ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV3)  ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV4)  ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV6)  ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV8)  ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV10) ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV12) ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV14) ||\
                                                 ((INSTANCE) == RCC_HSIOSC_DIV16))

/* SYSCTRL LSI --------------------------------------------------------*/
#define RCC_LSI_TRIMCODEADDR                    (0x00012602U)
#define RCC_LSI_WAITCYCLE_6                     ((uint32_t)(0x0UL << SYSCTRL_LSI_WAITCYCLE_Pos))
#define RCC_LSI_WAITCYCLE_18                    ((uint32_t)(0x1UL << SYSCTRL_LSI_WAITCYCLE_Pos))
#define RCC_LSI_WAITCYCLE_66                    ((uint32_t)(0x2UL << SYSCTRL_LSI_WAITCYCLE_Pos))
#define RCC_LSI_WAITCYCLE_258                   ((uint32_t)(0x3UL << SYSCTRL_LSI_WAITCYCLE_Pos))


/* SYSCTRL HSE --------------------------------------------------------*/
#define RCC_HSE_FLT_CLOSE                       (0x00000000U)
#define RCC_HSE_FLT_OPEN                        SYSCTRL_HSE_FLT_Msk //(0x80UL)
#define IS_RCC_HSE_FLT(INSTANCE)                (((INSTANCE) == RCC_HSE_FLT_CLOSE) ||\
                                                 ((INSTANCE) == RCC_HSE_FLT_OPEN))

#define RCC_HSE_MODE_OSC                        (0x00000000U)
#define RCC_HSE_MODE_CLK                        SYSCTRL_HSE_MODE_Msk //(0x40UL)
#define IS_RCC_HSE_MODE(INSTANCE)               (((INSTANCE) == RCC_HSE_MODE_OSC) ||\
                                                 ((INSTANCE) == RCC_HSE_MODE_CLK))

#define RCC_HSE_WAITCYCLE_8192                  (0x00000000U)
#define RCC_HSE_WAITCYCLE_32768                 ((uint32_t)(0x1UL << SYSCTRL_HSE_WAITCYCLE_Pos))
#define RCC_HSE_WAITCYCLE_131072                ((uint32_t)(0x2UL << SYSCTRL_HSE_WAITCYCLE_Pos))
#define RCC_HSE_WAITCYCLE_262144                ((uint32_t)(0x3UL << SYSCTRL_HSE_WAITCYCLE_Pos))

#define RCC_HSE_FREQ_GT4M                       (0x00000000U)
#define RCC_HSE_FREQ_GT8M                       ((uint32_t)(0x1UL << SYSCTRL_HSE_FREQRANGE_Pos))
#define RCC_HSE_FREQ_GT16M                      ((uint32_t)(0x2UL << SYSCTRL_HSE_FREQRANGE_Pos))
#define RCC_HSE_FREQ_GT24M                      ((uint32_t)(0x3UL << SYSCTRL_HSE_FREQRANGE_Pos))
#define IS_RCC_HSE_FREQIN(INSTANCE)             (((INSTANCE) >=4000000)  && ((INSTANCE) <=32000000))

#define RCC_HSE_DRIVER_LEAST                    0x00U
#define RCC_HSE_DRIVER_SMALL                    0x01U
#define RCC_HSE_DRIVER_NORMAL                   0x02U
#define RCC_HSE_DRIVER_LARGER                   0x03U
#define IS_RCC_HSE_DRIVER(INSTANCE)             (((INSTANCE) == RCC_HSE_DRIVER_LEAST)  ||\
                                                 ((INSTANCE) == RCC_HSE_DRIVER_SMALL)  ||\
                                                 ((INSTANCE) == RCC_HSE_DRIVER_NORMAL) ||\
                                                 ((INSTANCE) == RCC_HSE_DRIVER_LARGER))

/* SYSCTRL LSE --------------------------------------------------------*/
#define RCC_LSE_MODE_OSC                        (0x00000000U)
#define RCC_LSE_MODE_CLK                        SYSCTRL_LSE_MODE_Msk

#define IS_RCC_LSE_MODE(INSTANCE)               (((INSTANCE) == RCC_LSE_MODE_OSC) ||\
                                                 ((INSTANCE) == RCC_LSE_MODE_CLK))

#define RCC_LSE_AMP_LEAST                       (0x00000000U)
#define RCC_LSE_AMP_SMALL                       ((uint32_t)(0x1UL << SYSCTRL_LSE_AMP_Pos))
#define RCC_LSE_AMP_NORMAL                      ((uint32_t)(0x2UL << SYSCTRL_LSE_AMP_Pos))
#define RCC_LSE_AMP_LARGER                      ((uint32_t)(0x3UL << SYSCTRL_LSE_AMP_Pos))
#define IS_RCC_LSE_AMP(AMP)                     (((AMP) == RCC_LSE_AMP_LEAST)  ||\
                                                 ((AMP) == RCC_LSE_AMP_SMALL)  ||\
                                                 ((AMP) == RCC_LSE_AMP_NORMAL) ||\
                                                 ((AMP) == RCC_LSE_AMP_LARGER))

#define RCC_LSE_DRIVER_LEAST                    (0x00000000U)
#define RCC_LSE_DRIVER_SMALL                    (0x00000001U)
#define RCC_LSE_DRIVER_NORMAL                   (0x00000002U)
#define RCC_LSE_DRIVER_LARGER                   (0x00000003U)

#define IS_RCC_LSE_DRIVER(DRIVER)               (((DRIVER) == RCC_LSE_DRIVER_LEAST)||\
                                                 ((DRIVER) == RCC_LSE_DRIVER_SMALL)   ||\
                                                 ((DRIVER) == RCC_LSE_DRIVER_NORMAL)  ||\
                                                 ((DRIVER) == RCC_LSE_DRIVER_LARGER))

