rushairer/LearnCW32/Libraries/inc/cw32f030_rcc.h
#define __RCC_I2C2_CLK_DISABLE()                (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_I2C2))
#define __RCC_I2C1_CLK_DISABLE()                (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_I2C1))
#define __RCC_UART3_CLK_DISABLE()               (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART3))
#define __RCC_UART2_CLK_DISABLE()               (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_UART2))
#define __RCC_SPI2_CLK_DISABLE()                (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_SPI2))
#define __RCC_IWDT_CLK_DISABLE()                (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_IWDT))
#define __RCC_WWDT_CLK_DISABLE()                (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_WWDT))
#define __RCC_RTC_CLK_DISABLE()                 (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_RTC))
#define __RCC_GTIM2_CLK_DISABLE()               (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_GTIM2))
#define __RCC_GTIM1_CLK_DISABLE()               (CW_SYSCTRL->APBEN1 &= ~(RCC_APB1_PERIPH_GTIM1))

#define RCC_APB2_PERIPH_AWT                     bv13
#define RCC_APB2_PERIPH_BTIM                    bv12
#define RCC_APB2_PERIPH_GTIM4                   bv11
#define RCC_APB2_PERIPH_GTIM3                   bv10
#define RCC_APB2_PERIPH_UART1                   bv9
#define RCC_APB2_PERIPH_SPI1                    bv8
#define RCC_APB2_PERIPH_ATIM                    bv7
#define RCC_APB2_PERIPH_VC                      bv4
#define RCC_APB2_PERIPH_ADC                     bv2
#define IS_RCC_APB2_PERIPH(PERIPH)              ((((PERIPH) & 0xFFFFC06D ) == 0x00) && ((PERIPH) != 0x00))

#define __RCC_AWT_CLK_ENABLE()                  REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_AWT)
#define __RCC_BTIM_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_BTIM)
#define __RCC_GTIM4_CLK_ENABLE()                REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_GTIM4)
#define __RCC_GTIM3_CLK_ENABLE()                REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_GTIM3)
#define __RCC_UART1_CLK_ENABLE()                REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_UART1)
#define __RCC_SPI1_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_SPI1)
#define __RCC_ATIM_CLK_ENABLE()                 REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_ATIM)
#define __RCC_VC_CLK_ENABLE()                   REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_VC)
#define __RCC_ADC_CLK_ENABLE()                  REGBITS_SET(CW_SYSCTRL->APBEN2, RCC_APB2_PERIPH_ADC)


#define __RCC_AWT_CLK_DISABLE()                 (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_AWT))
#define __RCC_BTIM_CLK_DISABLE()                (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_BTIM))
#define __RCC_GTIM4_CLK_DISABLE()               (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_GTIM4))
#define __RCC_GTIM3_CLK_DISABLE()               (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_GTIM3))
#define __RCC_UART1_CLK_DISABLE()               (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_UART1))
#define __RCC_SPI1_CLK_DISABLE()                (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_SPI1))
#define __RCC_ATIM_CLK_DISABLE()                (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_ATIM))
#define __RCC_VC_CLK_DISABLE()                  (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_VC))
#define __RCC_ADC_CLK_DISABLE()                 (CW_SYSCTRL->APBEN2 &= ~(RCC_APB2_PERIPH_ADC))

#define RCC_MCO_DIV1                            (0x00U)
#define RCC_MCO_DIV2                            ((uint8_t)(0x01U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV8                            ((uint8_t)(0x02U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV64                           ((uint8_t)(0x03U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV128                          ((uint8_t)(0x04U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV256                          ((uint8_t)(0x05U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV512                          ((uint8_t)(0x06U << SYSCTRL_MCO_DIV_Pos))
#define RCC_MCO_DIV1024                         ((uint8_t)(0x07U << SYSCTRL_MCO_DIV_Pos))

#define IS_RCC_MCO_DIV(INSTANCE)                (((INSTANCE) == RCC_MCO_DIV1)   ||\
                                                 ((INSTANCE) == RCC_MCO_DIV2)   ||\
                                                 ((INSTANCE) == RCC_MCO_DIV8)   ||\
                                                 ((INSTANCE) == RCC_MCO_DIV64)  ||\
                                                 ((INSTANCE) == RCC_MCO_DIV128) ||\
                                                 ((INSTANCE) == RCC_MCO_DIV256) ||\
                                                 ((INSTANCE) == RCC_MCO_DIV512) ||\
                                                 ((INSTANCE) == RCC_MCO_DIV1024))

#define RCC_MCO_SRC_NONE                        (0x00U)
#define RCC_MCO_SRC_HCLK                        (0x01U)
#define RCC_MCO_SRC_PCLK                        (0x02U)
#define RCC_MCO_SRC_HSI                         (0x03U)
#define RCC_MCO_SRC_LSI                         (0x04U)
#define RCC_MCO_SRC_HSE                         (0x05U)
#define RCC_MCO_SRC_LSE                         (0x06U)
#define RCC_MCO_SRC_PLL                         (0x07U)
#define RCC_MCO_SRC_RC150K                      (0x08U)
#define RCC_MCO_SRC_RC10K                       (0x09U)

#define IS_RCC_MCO_SRC(INSTANCE)                (((INSTANCE) == RCC_MCO_SRC_NONE)   || \
                                                 ((INSTANCE) == RCC_MCO_SRC_HCLK)   || \
                                                 ((INSTANCE) == RCC_MCO_SRC_PCLK)   || \
                                                 ((INSTANCE) == RCC_MCO_SRC_HSI)    || \
                                                 ((INSTANCE) == RCC_MCO_SRC_LSI)    || \
                                                 ((INSTANCE) == RCC_MCO_SRC_HSE)    || \
                                                 ((INSTANCE) == RCC_MCO_SRC_LSE)    || \
                                                 ((INSTANCE) == RCC_MCO_SRC_PLL)    || \
                                                 ((INSTANCE) == RCC_MCO_SRC_RC150K) || \
                                                 ((INSTANCE) == RCC_MCO_SRC_RC10K))

